import math
import pandas as pd
from scipy import stats

with open("Москва_2021.txt", 'r') as f:
    a = list(map(int, f))
groups = 7
interval = math.ceil((max(a) - min(a))/groups)
a.sort()
uniques = list(set(a))
discrete = []
for i in range(len(uniques)):
    age = uniques[i]
    count = a.count(uniques[i])
    probability = round(count/len(a), 3)
    frequency = count * probability
    discrete.append([age, count, frequency])
df = pd.DataFrame(discrete)
df.columns = ["возраст преступника", "кол-во преступлений", "частота преступлений"]
print(df)


corr_matrix = df[["возраст преступника", "частота преступлений"]].corr()
corr_matrix
r = corr_matrix.iloc[0, 1]

cov_matrix = round(df[["возраст преступника", "частота преступлений"]].cov(), 4)
print(f"""матрица ковариаций:
      {cov_matrix}
""")
print(f"ковариация: {round(cov_matrix.iloc[0, 1], 4)}\n")

std_x = df["возраст преступника"].std()
std_y = df["частота преступлений"].std()
print(f"ско x: {round(std_x, 4)}")
print(f"ско y: {round(std_y, 4)}\n")

print(f"коэффициент линейной корреляции между возрастом преступника (X) и частотой совершаемых преступлений (Y) = {round(r, 4)}\n")
print(f"проверим выполнение свойств коэффициента корреляции Пирсона:\n")

if r >= -1 and r <= 1:
    print("свойство 1) −1 ≤ r ≤ 1 - выполняется")
else:
    print("свойство 1) −1 ≤ r ≤ 1 - не выполняется")

if r != 0:
    print("свойство 2) при r ≠ 0 величины коррелированы")
else:
    print("свойство 2) при r = 0 величины некоррелированы")

data_corr = df.copy()
data_corr * 2
data_corr + 10
data_corr_matrix = data_corr[["возраст преступника", "частота преступлений"]].corr()
if data_corr_matrix.iloc[0, 1] == r:
    print("свойство 3) r не меняется от прибавления к х и у постоянных (неслучайных) слагаемых и от умножения х и у на положительные числа - выполняется")
else:
    print("свойство 3) r не меняется от прибавления к х и у постоянных (неслучайных) слагаемых и от умножения х и у на положительные числа - не выполняется")

if r > 0:
    print("свойсвто 4) положительное значение коэффициента корреляции указывает на прямую зависимость")
else:
    print("свойсвто 4) отрицательное значение коэффициента корреляции указывает на обратную зависимость")

if 0 < abs(r) <= 0.3:
    print("свойство 5) 0 < |r| ≤ 0,3 зависимость слабая")
elif 0.3 < abs(r) <= 0.5:
    print("свойство 6) при 0,3 < |r| ≤ 0,5 зависимость умеренная")
elif 0.5 < abs(r) <= 0.7:
    print("свойство 7) при 0,5 < |r| ≤ 0,7 зависимость заметная")
elif 0.7 < abs(r) < 1:
    print("свойство 8) при 0,7 < |r| < 1 зависимость сильная")
else:
    print("свойство 9) при |r| = 1 между величинами функциональная зависимость")


print("""проверим нулевую гипотезу о значимости выборочного коэффициента корреляции:
      нулевая гипотеза H0: 𝜌xy = 0
      конкурирующая гипотеза H1: 𝜌xy ≠ 0
      """)

alpha = 0.05
k = len(uniques) - 2
T = (r * math.sqrt(k)) / math.sqrt(1 - r**2)
print(f"В качестве критерия проверки нулевой гипотезы принимем случайную величину T = {round(T, 5)}")

t_cr = stats.t.ppf(alpha, k)
print(f"tкр = {round(t_cr, 4)}\n")
if abs(T) < t_cr:
    print(f"так как |Tнабл| < tнабл, нет оснований отвергнуть нулевую гипотезу")
else:
    print(f"так как |Tнабл| > tнабл, нуневая гипотеза отвергается")


import matplotlib.pyplot as plt

plt.figure(figsize=(20, 6))
plt.scatter(df["возраст преступника"], df["кол-во преступлений"])
plt.plot(df["возраст преступника"], df["кол-во преступлений"])
plt.xticks(df["возраст преступника"])

for i, row in df.iterrows():
    plt.annotate(f"({row['возраст преступника']}; {row["кол-во преступлений"]:.1f})", (row["возраст преступника"], row["кол-во преступлений"]), textcoords="offset points", xytext=(5, 5))

plt.xlabel("возраст преступника")
plt.ylabel("кол-во преступлений")
plt.title('корреляционное поле')
plt.grid(True)
plt.savefig('images/corr4.png')
